<script setup>
import { paginationMeta } from "@/@fake-db/utils";
import ConfirmDeleteDialog from "@/components/ConfirmDeleteDialog.vue";
import { onMounted } from "vue";
import { toast } from "vue3-toastify";
import "vue3-toastify/dist/index.css";
import { VDataTableServer } from "vuetify/labs/VDataTable";
import ServiceDevice from "@/views/pages/services/ServiceDevice.vue";
import Booking from "@/views/pages/formBooking/Booking.vue";
const totalInvoices = ref(0);
const invoices = ref([]);
const selectedRows = ref([]);
const apiData = ref();
const isLoading = ref(false);
const currentPage = ref(1);
const listBanner = ref([
  {
    id: 1,
    link:
      "https://suachualaptop24h.com/images/slideshow/2020/06/12/compress2/slide_sc1_1591958105.jpg.webp",
  },
  {
    id: 2,
    link:
      "https://suachualaptop24h.com/images/slideshow/2024/04/24/compress2/dich-vu-sua-chua-laptop_1713929666.jpg.webp",
  },
]);
const allServices = [
  {
    id: 1,
    title: "Sửa màn hình laptop",
    icon: "tabler-rocket",
    avatarColor: "success",
  },
  {
    id: 2,
    title: "Dịch vụ sửa laptop",
    icon: "tabler-box",
    avatarColor: "info",
  },
  {
    id: 3,
    title: "Bảo hành thiết bị",
    icon: "tabler-users",
    avatarColor: "primary",
  },
  {
    id: 4,
    title: "Thay linh kiện PC",
    icon: "tabler-message",
    avatarColor: "warning",
  },
  {
    id: 5,
    title: "Laptop repair service",
    icon: "tabler-link",
    avatarColor: "secondary",
  },
  {
    id: 6,
    title: "Mua bán thiết bị",
    icon: "tabler-star",
    avatarColor: "primary",
  },
];
const instance = getCurrentInstance();
const options = ref({
  page: 1,
  itemsPerPage: 10,
  sortBy: [],
  groupBy: [],
  search: undefined,
});
currentPage.value = options.value.page;
const paginatedData = computed(() => {
  const start = (options.value.page - 1) * options.value.itemsPerPage;
  const end = start + options.value.itemsPerPage;
  return invoices.value.slice(start, end);
});

const totalPages = computed(() => {
  return Math.ceil((invoices.value.length * 1.0) / options.value.itemsPerPage);
});

const formatDate = (dateString) => {
  const date = new Date(dateString);
  const year = date.getFullYear();
  const month = String(date.getMonth() + 1).padStart(2, "0");
  const day = String(date.getDate()).padStart(2, "0");

  return `${year}-${month}-${day}`;
};

const refreshData = async () => {};

watchEffect(async () => {});

onMounted(async () => {});
</script>

<template>
  <div>
    <div class="slider">
      <VCarousel
        show-arrows="hover"
        hide-delimiters
        continuous="true"
        cycle
        interval="2000"
      >
        <VCarouselItem v-for="b in listBanner" :key="b.id" :src="b.link" cover>
        </VCarouselItem>
      </VCarousel>
    </div>
    <div>
      <VCardText class="bg-var-theme-background py-12">
        <h5 class="text-h3 text-center my-6">Dịch vụ sửa chữa</h5>

        <ServiceDevice :services="allServices" />

        <h5 class="text-h3 text-center my-6">Đặt lịch hẹn sửa chữa</h5>

        <Booking />

        <p class="mt-4 text-center">
          Liên hệ tổng đài 1800 6024 - Hoặc 085 245 3366 để được đặt lịch.
        </p>
      </VCardText>
    </div>
    <div class="block_strengths strengths-_strengths strengths_0 block" id="block_id_136">
      <div class="strengths-top-one-block cls">
        <div class="top-one-t">
          <div class="container cls d-flex">
            <div class="box-l cls">
              <div class="icon">
                <a
                  href="/ct-sua-laptop-lay-ngay-trong-01-gio.html"
                  title="Số 1 về bảo hành và sửa chữa tại việt nam"
                >
                  <svg
                    width="60px"
                    x="0px"
                    y="0px"
                    viewBox="0 0 140.41 216.39"
                    style="enable-background: new 0 0 140.41 216.39"
                    xml:space="preserve"
                  >
                    <g>
                      <g>
                        <g>
                          <path
                            d="M116.76,40.08l-4.32,14.57l18.43-7.69v106.41c0,9.5-5.06,18.28-13.29,23.04l-47.37,27.34l-47.38-27.34     c-8.23-4.75-13.29-13.53-13.29-23.04V46.96l50.61,21.13l2.92-11.55L0,30.21v127.88c0,11,5.87,21.15,15.39,26.65l54.82,31.65     l54.81-31.65c9.52-5.5,15.39-15.65,15.39-26.65V30.21L116.76,40.08z"
                          ></path>
                        </g>
                      </g>
                      <g>
                        <path
                          d="M71.68,197.34l-36.02-19.88L72.31,40.47H42.42L121.66,0L71.68,197.34z"
                        ></path>
                      </g>
                    </g>
                  </svg>
                </a>
              </div>
              <div class="tex-all">
                <a
                  href="/ct-sua-laptop-lay-ngay-trong-01-gio.html"
                  title="Số 1 về bảo hành và sửa chữa tại việt nam"
                >
                  <div class="text1 text-white" style="margin-left: 20px">Số 1 về bảo hành</div>
                  <div class="text2 text-white" style="margin-left: 20px">&amp; sửa chữa tại việt nam</div>
                </a>
              </div>
            </div>

            <div class="box-r">
              <div class="item">
                <a
                  href="/dich-vu-laptop/trung-tam-sua-chua-may-tinh-nao-co-dich-vu-bao-hanh-dai-nhat-ha-noi-n4925.html"
                  title="Bảo hành từ 6 đến 36 tháng"
                >
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="42"
                      height="51"
                      viewBox="0 0 42 51"
                    >
                      <g fill="none">
                        <path
                          fill="#FF8533"
                          d="M21.53.097l19.364 7.169c.615.225 1.024.814 1.024 1.471v16.75c0 19.057-20.328 24.648-20.533 24.703-.132.033-.268.052-.402.052s-.27-.019-.402-.052C20.376 50.135.049 44.54.049 25.487V8.737c0-.657.408-1.246 1.025-1.471L20.44.097c.352-.13.739-.13 1.09 0z"
                        ></path>
                        <path
                          fill="#FFF"
                          d="M20.983 38.728c-7.503 0-13.607-6.104-13.607-13.608 0-7.502 6.104-13.607 13.607-13.607 7.503 0 13.608 6.105 13.608 13.607 0 7.504-6.105 13.608-13.608 13.608zm0-24.075c-5.772 0-10.467 4.696-10.467 10.467 0 5.772 4.695 10.468 10.467 10.468s10.468-4.696 10.468-10.468c0-5.771-4.696-10.467-10.468-10.467z"
                        ></path>
                        <path
                          fill="#FFF"
                          d="M24.647 30.354c-.402 0-.804-.153-1.11-.46l-3.664-3.664c-.295-.295-.46-.693-.46-1.11v-5.756c0-.867.703-1.57 1.57-1.57.867 0 1.57.703 1.57 1.57v5.105l3.203 3.204c.614.613.614 1.607 0 2.22-.306.308-.707.461-1.11.461z"
                        ></path>
                      </g>
                    </svg>
                  </div>
                  <div class="text">Bảo hành từ 6 đến 36 tháng</div>
                </a>
              </div>
              <div class="item">
                <a
                  href="/dich-vu-laptop/phan-phoi-sac-laptop-chinh-hang-bao-hanh-36-thang-ca-chay-no-n4915.html"
                  title="Bảo hành cả cháy nổ"
                >
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="42"
                      height="48"
                      viewBox="0 0 42 48"
                    >
                      <g fill="#FF8533">
                        <path
                          d="M33.223 6.507l3.008-5.34c.135-.241.135-.538 0-.778-.136-.24-.386-.389-.658-.389H21c-.31 0-.59.194-.705.489l-.802 2.055C8.533 3.34 0 12.692 0 24c0 8.3 4.647 15.823 11.908 19.396l-1.332 3.547c-.133.356.004.757.324.95.12.072.253.107.384.107.219 0 .435-.097.583-.28l2.648-3.254c2.088.694 4.268 1.046 6.485 1.046 11.58 0 21-9.65 21-21.512 0-6.957-3.27-13.45-8.777-17.493zm-1.01 15.504c-.125-.273-.393-.447-.688-.447h-6.782l6.088-10.81c4.026 3.143 6.412 8.043 6.412 13.246 0 9.175-7.286 16.64-16.243 16.64-1.052 0-2.098-.104-3.122-.308l14.23-17.493c.189-.232.23-.554.105-.828zm-21.557 4.084c.141.213.377.341.628.341h6.992l-4.653 12.39C8.213 35.996 4.757 30.261 4.757 24c0-3.994 1.402-7.856 3.948-10.874 2.29-2.715 5.367-4.595 8.752-5.368L10.58 25.37c-.094.24-.065.511.076.725zM1.518 24c0-10.235 7.534-18.742 17.343-19.837l-.735 1.88c-4.093.683-7.843 2.833-10.57 6.066C4.772 15.41 3.24 19.633 3.24 24c0 6.9 3.839 13.22 9.836 16.287l-.62 1.652C5.783 38.602 1.518 31.658 1.518 24zM21 43.957c-1.851 0-3.674-.265-5.431-.787l1.215-1.494c1.374.343 2.79.518 4.216.518 9.794 0 17.761-8.162 17.761-18.194 0-5.756-2.669-11.174-7.165-14.603l.864-1.536c5.036 3.757 8.022 9.737 8.022 16.139 0 11.004-8.74 19.957-19.482 19.957z"
                        ></path>
                        <path
                          d="M21.514 1.555h12.745L22.771 21.953c-.135.24-.135.537 0 .777.136.24.387.389.658.389h6.476L13.712 43.024c0-.03-.002-.058-.006-.086l6.383-17c.09-.24.059-.508-.083-.72-.141-.21-.375-.337-.625-.337h-6.976l9.109-23.326z"
                        ></path>
                      </g>
                    </svg>
                  </div>
                  <div class="text">Bảo hành cả cháy nổ</div>
                </a>
              </div>
              <div class="item">
                <a
                  href="/tin-cong-ty/chinh-sach-bao-hanh-cua-suachualaptop24hcom-n5709.html"
                  title="Chính sách bảo hành"
                >
                  <div class="icon">
                    <svg
                      height="40pt"
                      viewBox="0 0 454 454.11881"
                      width="40pt"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="m448.984375 213.21875c-.121094-1.992188-1.089844-3.839844-2.660156-5.074219-1.566407-1.234375-3.589844-1.738281-5.554688-1.390625l-85.496093 15.273438c-3.339844.59375-5.769532 3.496094-5.769532 6.890625 0 67.929687-55.070312 123-123 123-67.933594 0-123-55.070313-123-123 0-67.933594 55.066406-123 123-123 3.433594 0 6.359375-2.492188 6.910156-5.882813l14.03125-86.726562c.3125-1.949219-.210937-3.941406-1.445312-5.484375s-3.0625-2.492188-5.035156-2.613281l-46.039063-2.84375c-3.769531-.230469-7.042969 2.570312-7.398437 6.332031l-4.007813 42.632812c-18.332031 4.351563-35.886719 11.5-52.046875 21.195313l-33.230468-27.390625c-2.78125-2.292969-6.851563-2.097657-9.398438.449219l-45.671875 45.667968c-2.546875 2.550782-2.742187 6.617188-.449219 9.402344l27.375 33.210938c-9.769531 16.125-16.925781 33.699218-21.199218 52.0625l-42.550782 4c-3.585937.34375-6.316406 3.371093-6.2890622 6.976562v64.421875c-.0234376 3.601563 2.7031252 6.625 6.2890622 6.96875l42.605469 4.003906c4.34375 18.335938 11.484375 35.890625 21.171875 52.050781l-27.398438 33.234376c-2.296874 2.78125-2.101562 6.847656.445313 9.398437l44.019531 44.023437c2.546875 2.546876 6.617188 2.742188 9.398438.453126l33.234375-27.394532c16.160156 9.691406 33.714843 16.839844 52.046875 21.1875l4 42.574219c.34375 3.589844 3.375 6.320313 6.980468 6.289063h64.417969c3.601563.027343 6.628907-2.703126 6.972657-6.285157l4-42.578125c18.363281-4.269531 35.941406-11.417968 52.070312-21.183594l33.214844 27.382813c2.78125 2.292969 6.847656 2.097656 9.398437-.449219l45.664063-45.664062c2.546875-2.550782 2.742187-6.617188.449218-9.398438l-27.390624-33.234375c9.691406-16.15625 16.839843-33.707031 21.1875-52.039062l42.632812-4.007813c3.765625-.355468 6.566406-3.628906 6.332031-7.402344zm-52.523437 43.984375c-3.058594.285156-5.574219 2.53125-6.203126 5.539063-4.1875 20.175781-12.015624 39.417968-23.097656 56.789062-1.628906 2.554688-1.429687 5.871094.5 8.214844l26.539063 32.199218-36.671875 36.671876-32.203125-26.535157c-2.347657-1.941406-5.683594-2.132812-8.246094-.484375-17.296875 11.167969-36.535156 18.996094-56.71875 23.074219-3.015625.585937-5.285156 3.089844-5.578125 6.148437l-3.882812 41.296876h-51.675782l-3.886718-41.296876c-.289063-3.054687-2.539063-5.558593-5.542969-6.171874-20.171875-4.183594-39.417969-12.007813-56.789063-23.085938-2.5625-1.625-5.875-1.417969-8.214844.511719l-32.199218 26.539062-35.027344-35.03125 26.535156-32.199219c1.929688-2.34375 2.128906-5.65625.5-8.214843-11.082031-17.371094-18.910156-36.617188-23.101562-56.792969-.597656-2.996094-3.09375-5.25-6.140625-5.539062l-41.296875-3.882813v-51.671875l41.300781-3.890625c3.066406-.289063 5.574219-2.554687 6.175781-5.574219 4.078125-20.183594 11.902344-39.421875 23.066406-56.722656 1.648438-2.558594 1.453126-5.894531-.488281-8.246094l-26.539062-32.191406 36.671875-36.671875 32.191406 26.535156c2.339844 1.925781 5.65625 2.128907 8.214844.5 17.371094-11.089843 36.613281-18.917969 56.789062-23.113281 3.007813-.628906 5.253906-3.140625 5.542969-6.199219l3.847656-40.953125 31.558594 1.945313-11.867187 73.339843c-72.78125 3.136719-131.019532 63.332032-131.019532 136.871094 0 75.542969 61.457032 137 137 137 73.574219 0 133.785156-58.289062 136.875-131.117187l72.113282-12.878907 1.925781 31.433594zm0 0"
                      ></path>
                      <path
                        d="m450.316406 55.585938c-2.046875-1.25-4.589844-1.363282-6.742187-.304688l-29.855469 14.699219-10.011719-20.34375 33.242188-16.359375c1.921875-.945313 3.304687-2.722656 3.753906-4.816406.449219-2.097657-.085937-4.285157-1.457031-5.933594-1.183594-1.425782-2.480469-2.847656-3.859375-4.226563-17.863281-17.867187-44.734375-23.214843-68.078125-13.546875-23.339844 9.667969-38.5625 32.449219-38.558594 57.714844 0 1.941406.101562 3.863281.269531 5.773438l-121.492187 121.492187c-1.90625-.175781-3.832032-.273437-5.773438-.273437-16.742187 0-32.785156 6.722656-44.527344 18.660156-11.742187 11.9375-18.199218 28.089844-17.921874 44.832031.042968 2.394531 1.308593 4.605469 3.351562 5.851563 2.046875 1.25 4.589844 1.363281 6.738281.308593l29.855469-14.703125 10.015625 20.335938-33.242187 16.351562c-1.921876.9375-3.308594 2.703125-3.757813 4.792969s.089844 4.265625 1.457031 5.910156c1.179688 1.421875 2.480469 2.777344 3.863282 4.160157 11.703124 11.714843 27.609374 18.253906 44.167968 18.15625 17.375.074218 33.984375-7.128907 45.808594-19.859376 11.824219-12.730468 17.78125-29.828124 16.429688-47.148437l122.378906-122.378906c1.597656.121093 3.214844.199219 4.839844.199219 16.746093.003906 32.789062-6.71875 44.53125-18.65625 11.742187-11.9375 18.199218-28.089844 17.917968-44.832032-.039062-2.394531-1.300781-4.605468-3.34375-5.855468zm-214.289062 230.472656c-9.082032 9.082031-21.425782 14.144531-34.269532 14.058594-11.214843.082031-22.109374-3.769532-30.78125-10.890626l30.757813-15.070312c1.660156-.792969 2.933594-2.21875 3.535156-3.957031.597657-1.757813.472657-3.683594-.347656-5.347657l-16.199219-32.898437c-1.707031-3.46875-5.902344-4.898437-9.371094-3.191406l-24.828124 12.222656c4.589843-20.074219 21.367187-35.054687 41.832031-37.351563 20.460937-2.300781 40.144531 8.582032 49.074219 27.136719 8.933593 18.554688 5.164062 40.726563-9.398438 55.289063zm24.5-55.28125c-6.214844-17.261719-19.695313-30.925782-36.875-37.371094l109.042968-109.039062c6.449219 17.167968 20.097657 30.652343 37.34375 36.898437zm164.957031-134.039063c-18.492187 18.464844-48.296875 18.9375-67.359375 1.0625s-20.511719-47.648437-3.273438-67.289062c17.238282-19.640625 46.949219-22.066407 67.144532-5.480469l-30.753906 15.136719c-3.46875 1.707031-4.898438 5.90625-3.191407 9.375l16.199219 32.898437c1.710938 3.46875 5.90625 4.898438 9.375 3.1875l24.835938-12.222656c-2.035157 8.847656-6.535157 16.9375-12.976563 23.332031zm0 0"
                      ></path>
                    </svg>
                  </div>
                  <div class="text">Chính sách bảo hành</div>
                </a>
              </div>
              <div class="item">
                <a href="/he-thong-cua-hang.html" title="Hệ thống toàn quốc">
                  <div class="icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      xmlns:xlink="http://www.w3.org/1999/xlink"
                      version="1.1"
                      width="60px"
                      x="0px"
                      y="0px"
                      viewBox="0 0 511.999 511.999"
                      style="enable-background: new 0 0 511.999 511.999"
                      xml:space="preserve"
                    >
                      <g>
                        <g>
                          <path
                            d="M511.864,221.487c-0.921-11.988-6.455-22.896-15.581-30.716l-44.286-37.96V44.944c0-8.284-6.716-14.999-14.999-14.999    h-59.998c-8.284,0-14.799,6.716-14.799,14.999v30.728l-75.911-64.695c-16.97-14.539-41.603-14.537-58.519-0.043L15.728,190.769    c-18.753,16.068-21.186,44.423-4.866,63.473c12.439,14.465,32.364,19.077,49.35,13.107v229.584    c0,8.284,6.516,14.999,14.799,14.999h361.986c8.284,0,14.999-6.716,14.999-14.999V267.352c17.534,6.2,37.039,1.004,49.167-13.13    C508.983,245.094,512.784,233.468,511.864,221.487z M391.999,59.943h30.199v67.154l-30.199-25.713V59.943z M317.202,481.934    H195.007V361.738h122.195V481.934z M422.198,481.934h-75.197V346.939c0-8.284-6.716-14.999-14.999-14.999H180.007    c-8.284,0-14.799,6.716-14.799,14.999v134.995H90.011V245.775l166.943-141.613l165.245,141.473V481.934z M478.389,234.694    c-5.318,6.198-14.772,7.107-21.158,1.631L266.765,73.061c-5.595-4.797-13.845-4.817-19.464-0.05    C243.242,76.453,55.58,235.643,54.786,236.317c-6.282,5.375-15.782,4.642-21.161-1.615c-5.385-6.285-4.657-15.774,1.569-21.11    L247.238,33.756c5.66-4.848,13.874-4.849,19.53-0.002l209.994,179.795C483.04,218.929,483.767,228.419,478.389,234.694z"
                          ></path>
                        </g>
                      </g>
                      <g>
                        <g>
                          <path
                            d="M302.002,179.938h-91.996c-8.284,0-14.799,6.716-14.799,14.999v89.996c0,8.284,6.516,14.999,14.799,14.999h91.996    c8.284,0,14.999-6.716,14.999-14.999v-89.996C317.002,186.653,310.286,179.938,302.002,179.938z M287.203,269.935h-62.198v-59.998    h62.198V269.935z"
                          ></path>
                        </g>
                      </g>
                      <g>
                        <g><circle cx="271.999" cy="406.934" r="14.999"></circle></g>
                      </g>
                    </svg>
                  </div>
                  <div class="text">Hệ thống toàn quốc</div>
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="clear"></div>
    </div>
  </div>
</template>

<style lang="scss">
#invoice-list {
  .invoice-list-actions {
    inline-size: 8rem;
  }

  .invoice-list-filter {
    inline-size: 12rem;
  }
}

.strengths-top-one-block .top-one-t {
    background: #0088de;
    padding: 21px 0px;
}
.container {
    width: 1170px;
    max-width: 100%;
    margin: 0 auto;
}

.strengths-top-one-block .box-l {
    width: 30%;
    display: flex;
    margin-top: 12px;
}
.strengths-top-one-block .box-l .icon {
    width: 92px;
    height: 92px;
    background: #fff;
    text-align: center;
    border-radius: 50%;
    padding-top: 12px;
    box-sizing: border-box;
    float: left;
    animation: 4s ease-in-out 0s normal none infinite running chang-rotage-anim-2-bh;
}
.strengths-top-one-block .box-l .tex-all {
    width: calc(100% - 106px);
    float: right;
    color: #fff;
    font-style: italic;
    text-transform: uppercase;
    margin-top: 27px;
}
.strengths-top-one-block .box-r {
    width: calc(70% - 40px);
    float: right;
    background: #fff;
    padding: 37px 0px 25px 34px;
    display: flex
;
    flex-wrap: wrap;
    border-radius: 15px;
    box-sizing: border-box;
}
@media (min-width: 1169px) {
    .strengths-top-one-block .box-r {
        transform: skew(-19deg, 0deg);
    }
}
.strengths-top-one-block .box-r .item:nth-child(1) {
    padding-left: 0px;
}
@media (min-width: 1169px) {
    .strengths-top-one-block .box-r .item {
        transform: skew(19deg, 0deg);
    }
}
.strengths-top-one-block .box-r .item {
    width: 25%;
    float: left;
    padding: 0px 13px;
    box-sizing: border-box;
}
</style>
